# AlphanumericRevisionSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlphanumericRevisionSettings Class
Members See Also
---
Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class AlphanumericRevisionSettings : IDisposable
```

Visual Basic
---
```text
Public Class AlphanumericRevisionSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AlphanumericRevisionSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AlphanumericRevisionSettings
# See Also
AlphanumericRevisionSettings Members
Autodesk.Revit.DB Namespace